Revit 2015 API
InstanceNode Class
 An output node that represents a family instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
public class InstanceNode : GroupNode
Visual Basic
Public Class InstanceNode _
	Inherits GroupNode
Visual C++
public ref class InstanceNode : public GroupNode
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.GroupNode
 Autodesk.Revit.DB.InstanceNode
See Also
InstanceNode Members
Autodesk.Revit.DB Namespace